Revit 2027 API
RebarBendData Constructor
Overload List
Name | Description
RebarBendData() |  Constructs a new RebarBendData with default settings.
RebarBendData(RebarBarType, RebarStyle, BarTerminationsData) |  Constructs a new RebarBendData using the bar type, style and termination's values.
Top
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace